---
title: RebarRoundingManager
classe: Autodesk.Revit.DB.Structure.RebarRoundingManager
namespace: Autodesk.Revit.DB.Structure
eredita: Autodesk.Revit.DB.Structure.ReinforcementRoundingManager
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# RebarRoundingManager

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ReinforcementRoundingSource ApplicableReinforcementRoundingSource { get; }` | `rebarRoundingManager.ApplicableReinforcementRoundingSource` | ReinforcementRoundingSource |
| `Double ApplicableSegmentLengthRounding { get; }` | `rebarRoundingManager.ApplicableSegmentLengthRounding` | Double |
| `RoundingMethod ApplicableSegmentLengthRoundingMethod { get; }` | `rebarRoundingManager.ApplicableSegmentLengthRoundingMethod` | RoundingMethod |
| `Double ApplicableTotalLengthRounding { get; }` | `rebarRoundingManager.ApplicableTotalLengthRounding` | Double |
| `RoundingMethod ApplicableTotalLengthRoundingMethod { get; }` | `rebarRoundingManager.ApplicableTotalLengthRoundingMethod` | RoundingMethod |
| `Double SegmentLengthRounding { get; set; }` | `rebarRoundingManager.SegmentLengthRounding` | Double |
| `RoundingMethod SegmentLengthRoundingMethod { get; set; }` | `rebarRoundingManager.SegmentLengthRoundingMethod` | RoundingMethod |
| `Double TotalLengthRounding { get; set; }` | `rebarRoundingManager.TotalLengthRounding` | Double |
| `RoundingMethod TotalLengthRoundingMethod { get; set; }` | `rebarRoundingManager.TotalLengthRoundingMethod` | RoundingMethod |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```